# Задайте список из n чисел последовательности (1+1/n )^n и
# выведите на экран их сумму.
#*Пример:*
#- Для n = 6: {1: 4, 2: 7, 3: 10, 4: 13, 5: 16, 6: 19}
num = int(input('Введите число :'))
def fact(n):  
    pr=1
    a=[]
    for i in range(1,n+1):
        pr=(1+1/i)**i
        a.append(pr)     
    return a 
print(f'{num}: {fact(num)}')